/******************************************************************************
	[ﾀｲﾄﾙ]
		Referencer ﾓｰﾄﾞ  ﾒｯｾｰｼﾞ処理群 ﾍｯﾀﾞｰ

    [機種]
		ZX400 Referencer

	[作成者]
		鈴木茂人

	[備考]
		ZX481表計算ﾓｰﾄﾞより流用､改造

    Copyright (C) 2000 CASIO COMPUTER CO.,LTD. All rights reserved.
******************************************************************************/
#ifndef SPD_MSG_DEF
#define SPD_MSG_DEF
#include "define.h"

/************************************************/
/*               ﾘﾃﾗﾘ                           */
/************************************************/
#define SHIFT_NO		500
#define OBJ_BT_LFT		0xe010
#define OBJ_BT_RGT		0xe011

/************************************************/
/*                far ｴﾘｱ                       */
/************************************************/
static int far bmsg[5][2] = {
	{ 43, 44},				/* YES/NO  (2 Button) */
	{ 60,109},				/* SET/ESC (2 Button) */
	{447,447},				/* OK  (1 Button)     */
	{ 60, 60},				/* SET (1 Button)     */
	{109,109}				/* ESC (1 Button)     */
};

static byte far wim_myof[3][5] = {	/* ｳｨﾝﾄﾞｳ内ﾒｯｾｰｼﾞ表示開始Yｵﾌｾｯﾄ */
	{ 20, 16, 11,  7,  8},
	{ 11,  7,  8, 10,  6},
	{ 17, 12,  8, 10,  6}
};

static byte far wim_yp[3][5] = {	/* ﾒｯｾｰｼﾞｳｨﾝﾄﾞｳ表示開始Y座標 */
	{109,109,109,109, 97},
	{109,109, 97, 83, 83},
	{ 97, 97, 97, 83, 83},
};

static TCHTBL far TchBtnL[] = {		/* ｳｨﾝﾄﾞｳ内選択ﾎﾞﾀﾝ(左側)ﾃｰﾌﾞﾙ */
	(56+16),(105+32), (85+16),(120+32),	ACT_ICON,OBJ_BT_LFT,0x0000,	/*ZX485*/
	0,0,0,0,ACT_NONE,OBJ_END,0x0000
};
static T_ICON far TicnBtnL = { &TchBtnL[0],NULL,NULL, 0x02 };
static TCHTBL far TchBtnR[] = {		/* ｳｨﾝﾄﾞｳ内選択ﾎﾞﾀﾝ(右側)ﾃｰﾌﾞﾙ */
	(90+16),(105+32),(119+16),(120+32),ACT_ICON,OBJ_BT_RGT,0x0000,	/*ZX485*/
	0,0,0,0,ACT_NONE,OBJ_END,0x0000
};
static T_ICON far TicnBtnR = { &TchBtnR[0],NULL,NULL, 0x02 };
static byte	far wim_ic[] = {IB_MWIN_NO_ICON,46,10,11,24,28,55,25};
static byte	far wim_bt[] = {
	IB_MWIN_NONE | IX_MWIN_CENTER,	/* 画面中央 */
	IB_MWIN_NONE | IX_MWIN_CENTER,	/* 画面中央 */
	IB_MWIN_OK,
	IB_MWIN_ESC,
	IB_MWIN_SET,
	IB_MWIN_YES_NO,
	IB_MWIN_SET_ESC
};

/******************************************************************************/
/*                  5カ国語言語ﾃﾞｰﾀ (ﾘﾌｧﾚﾝｻｰﾓｰﾄﾞ用500番以降)                  */
/******************************************************************************/
/*** No.500 ***/
 /*独*/	static byte far _500d[] = {	'K','e','i','n','e',' ','w','e','i','t','e','r','e','n',0x40,
									'S','p','r',0xb4,'n','g','e',0x40,
									'm',0xb3,'g','l','i','c','h',0x21,0x00};
 /*英*/	static byte far _500e[] = {	'N','o',' ','m','o','r','e',0x40,
									'j','u','m','p','s',' ','a','l','l','o','w','e','d',0x21,0x00};
 /*西*/	static byte far _500s[] = {	0x8f,'N','o',' ','s','e',' ','p','e','r','m','i','t','e','n',0x40,
									'm',0x90,'s',' ','s','a','l','t','o','s',0x21,0x00};
 /*仏*/	static byte far _500f[] = {	'A','u','c','u','n',' ','n','o','u','v','e','a','u',0x40,
									's','a','u','t',' ','p','e','r','m','i','s',' ',0x21,0x00};
 /*伊*/	static byte far _500i[] = {	'N','e','s','s','u','n',0x27,'a','l','t','r','a',0x40,
 									'r','i','c','e','r','c','a',0x40,
 									'c','o','n','s','e','n','t','i','t','a',0x21,0x00};

/*** No.501 ***/
 /*独*/	static byte far _501d[] = {	'D','i','e','s','e',0x40,
									'P','V','-','A','n','w','e','n','d','u','n','g',0x40,
									'e','n','t','h',0xb0,'l','t',' ','k','e','i','n','e',0x40,
									'L','e','x','i','k','a',0x21,' ','L',0xb0,'u','f','t',0x40,
									'd','a','h','e','r',' ','n','i','c','h','t',0x2e,0x00};
 /*英*/	static byte far _501e[] = {	'T','h','i','s',' ','P','V',' ','A','p','p','l','i','c','a','t','i','o','n',0x40,
									'd','o','e','s',' ','n','o','t',' ','h','a','v','e',0x40,
									'a','n','y',' ','l','e','x','i','c','o','n','s',0x21,0x40,
									'I','t',' ','w','i','l','l',' ','n','o','t',' ','r','u','n',0x2e,0x00};
 /*西*/	static byte far _501s[] = {	'A','p','l','i','c','a','c','i',0x93,'n',' ','P','V',0x40,
									'n','o',' ','t','i','e','n','e',0x40,
									'l',0x91,'x','i','c','o','s',0x21,0x40,
									'N','o',' ','f','u','n','c','i','o','n','a','r',0x95,0x2e,0x00};
 /*仏*/	static byte far _501f[] = {	'C','e','t','t','e',' ','a','p','p','l','i','c',' ','P','V',0x40,
									'n',0x27,'a',' ','p','a','s',' ','d','e',0x40,
									'l','e','x','i','q','u','e',' ',0x21,' ','E','l','l','e',0x40,
									'n','e',' ','m','a','r','c','h','e','r','a',' ','p','a','s',0x2e,0x00};
 /*伊*/	static byte far _501i[] = {	'Q','u','e','s','t','a',0x40,
 									'a','p','p','l','i','c','a','z','i','o','n','e',' ','P','V',0x40,
 									'n','o','n',' ','h','a',' ','v','o','c','a','b','o','l','i',0x40,
 									'e',' ','n','o','n',0x40,
 									'f','u','n','z','i','o','n','e','r',0x95,0x2e,0x00};

/*** ﾎﾟｲﾝﾀﾃｰﾌﾞﾙ ***/
static byte far * far MessageTable[] = {
	_500d,_500e,_500s,_500f,_500i,
	_501d,_501e,_501s,_501f,_501i,
};

#endif
